spec/fixtures/vcr_cassettes/withdraw/create.yml

---
http_interactions:
- request:
    method: post
    uri: https://admin.vanilapay.com/api/v2/withdrawal
    body:
      encoding: UTF-8
      string: '{"order_id":"9911_4","method":"card","account":"4242424242424242","amount":"22.00","notification_url":"http://some.url/callback","success_url":"http://some.url/callback","fail_url":"http://some.url/callback"}'
    headers:
      Authorization:
      - Bearer 8ub1ReV5EwrZDLQS3LkwgQ19r1muidGYcPMBuvVt7VDFBGKwoeWXTg8mohZXFMu8
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Mon, 24 Apr 2023 14:37:39 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Powered-By:
      - PHP/8.1.11
      Cache-Control:
      - no-cache, private
      Content-Language:
      - ru_RU
      Vary:
      - Accept-Language
      Cf-Cache-Status:
      - DYNAMIC
      Report-To:
      - '{"endpoints":[{"url":"https:\/\/a.nel.cloudflare.com\/report\/v3?s=jBb4bMwjlTDm3E7lyS%2FqcVawENdZ5Rr4oJpnKjq8hkgGDhVgkaASTOWMe1vA3uNet5XokMpLPZE7EEGR455y3us%2B9fK%2BYVTohkI%2BYW0NcALRRRvldKqFEa760ccjYJjCHQ8vvfJC"}],"group":"cf-nel","max_age":604800}'
      Nel:
      - '{"success_fraction":0,"report_to":"cf-nel","max_age":604800}'
      Server:
      - cloudflare
      Cf-Ray:
      - 7bcf15e12c29324c-VIE
      Alt-Svc:
      - h3=":443"; ma=86400, h3-29=":443"; ma=86400
    body:
      encoding: UTF-8
      string: '{"id":"507311510","created_at":"2023-04-24T17:37:39+03:00","updated_at":"2023-04-24T17:37:39+03:00","action":"withdrawal","method":"card","payment_id":"363092417","order_id":"9911_4","account":"4242424242424242","amount":"22.00","payment_amount":"0.00","commission":"50.44","comment":null,"status":"process","payment_url":null,"payment_code":null,"payment_error_code":null,"payment_error":null,"currency":"RUB"}'
    http_version:
  recorded_at: Mon, 24 Apr 2023 14:37:39 GMT
recorded_with: VCR 5.1.0
