spec/fixtures/vcr_cassettes/withdraw/currency_rate.yml

---
http_interactions:
- request:
    method: post
    uri: https://admin.vanilapay.com/api/v2/withdrawal/rate
    body:
      encoding: UTF-8
      string: '{"method":"contact","account":"CFRN","amount":"2.00","currency":"USD"}'
    headers:
      Authorization:
      - Bearer 8ub1ReV5EwrZDLQS3LkwgQ19r1muidGYcPMBuvVt7VDFBGKwoeWXTg8mohZXFMu8
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 24 Apr 2023 14:42:06 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      - Accept-Language
      X-Powered-By:
      - PHP/8.1.11
      Cache-Control:
      - no-cache, private
      Content-Language:
      - ru_RU
      Cf-Cache-Status:
      - DYNAMIC
      Report-To:
      - '{"endpoints":[{"url":"https:\/\/a.nel.cloudflare.com\/report\/v3?s=kaW5GxuI8WYiD2cq050yaVUU2eoKd3lpqnxPqiCIs2w1SZdjH571iein76TpPufm1aSgSnKU2sdgYZgE6sBuHxLSoelJm9O8j1U48WjYN3ez2NyQoyyrBkgniDwUngQPzE9Vig5R"}],"group":"cf-nel","max_age":604800}'
      Nel:
      - '{"success_fraction":0,"report_to":"cf-nel","max_age":604800}'
      Server:
      - cloudflare
      Cf-Ray:
      - 7bcf1c53ddd478a6-VIE
      Alt-Svc:
      - h3=":443"; ma=86400, h3-29=":443"; ma=86400
    body:
      encoding: UTF-8
      string: '{"rate":"82.5200","amount":"165.04","message":"\u0412\u044b\u0432\u043e\u0434
        \u043d\u0430 \u0441\u0443\u043c\u043c\u0443: 165.04\u20bd, \u043f\u043e \u043a\u0443\u0440\u0441\u0443:
        1$ = 82.52\u20bd"}'
    http_version:
  recorded_at: Mon, 24 Apr 2023 14:42:06 GMT
recorded_with: VCR 5.1.0
